tests/singlerod/short/openmc_openfoam/constant/clad/clad_boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/clad/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    cladBottom
    {
        type            wall;
        ingroups        1(wall);
        nFaces          824;
        startFace       96576;
    }
    cladTop
    {
        type            wall;
        ingroups        1(wall);
        nFaces          824;
        startFace       97400;
    }
    cladOuter
    {
        type            mappedWall;
        ingroups        1(wall);
        nFaces          6000;
        startFace       98224;
        sampleMode      nearestPatchFace;
        sampleRegion    moderator;
        samplePatch     modInner;
    }
    cladInner
    {
        type            mappedWall;
        ingroups        1(wall);
        nFaces          5200;
        startFace       104224;
        sampleMode      nearestPatchFace;
        sampleRegion    fuel;
        samplePatch     fuelOuter;
    }
)

// ************************************************************************* //
