tests/singlerod/short/openmc_openfoam/constant/clad/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       polynomial;
    thermo          hPolynomial;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   50;
    }

    transport
    {
        kappaCoeffs<8>   (21.5 0 0 0 0 0 0 0);
    }

    thermodynamics
    {
        Hf      0;
        Sf      0;
        CpCoeffs<8>      (285 0 0 0 0 0 0 0);
    }

    equationOfState
    {
        rho     6550;
    }
}



// ************************************************************************* //
