tests/singlerod/short/openmc_openfoam/constant/moderator/mod_boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    modInlet
    {
        type            patch;
        physicalType    patch;
        nFaces          3340;
        startFace       1230260;
    }
    modOutlet
    {
        type            patch;
        physicalType    patch;
        nFaces          3340;
        startFace       1233600;
    }
    modInner
    {
        type            mappedWall;
        ingroups        1(wall);
        nFaces          13800;
        startFace       1236940;
        sampleMode      nearestPatchFace;
        sampleRegion    clad;
        samplePatch     cladOuter;
    }
    modOuter
    {
        type            wall;
        ingroups        1(wall);
        nFaces          24000;
        startFace       1250740;
    }
)

// ************************************************************************* //
