tests/singlerod/short/openmc_openfoam/0.orig/moderator/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 4.304);

boundaryField
{
    modInlet
    {
        type           fixedValue;
        value          uniform (0 0 4.304);
    }
    modOutlet
    {
        type            pressureInletOutletVelocity;
//        inletValue      $internalField;
        value           $internalField;
    }
    modInner
    {
        type            noSlip;
    }
    modOuter
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
