tests/singlerod/short/openmc_openfoam/0.orig/clad/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{
    //- Set patchGroups for constraint patches
//    #includeEtc "caseDicts/setConstraintTypes"

    cladBottom
    {
        type            calculated;
        value           uniform 1000;
    }

    cladTop
    {
        type            calculated;
        value           uniform 1000;
    }

    cladOuter
    {
        type            calculated;
        value           uniform 1000;
    }
    cladInner
    {
        type            calculated;
        value           uniform 1000;
    }
}

// ************************************************************************* //
