tests/singlerod/short/openmc_openfoam/0.orig/fuel/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
//    #includeEtc "caseDicts/setConstraintTypes"

    fuelBottom
    {
        type            calculated;
        value           uniform 0;
    }

    fuelUpper
    {
//        type            fixedValue;
        type            calculated;
        value           uniform 0;
    }

    fuelOuter
    {
//        type            zeroGradient;
        type            calculated;
        value           uniform 0;
    }
}

// ************************************************************************* //
