tests/singlerod/short/openmc_openfoam/0.orig/moderator/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1000;

boundaryField
{
    modInlet
    {
        type            calculated;
        value           uniform 1000;
    }
    modOutlet
    {
        type            calculated;
        value           uniform 1000;
    }
    modInner
    {
        type            calculated;
        value           uniform 1000;
    }
    modOuter
    {
        type            zeroGradient;
//        type            calculated;
//        value           uniform 1000;
    }
}

// ************************************************************************* //
