tests/singlerod/short/openmc_openfoam/0.orig/moderator/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0 ];

internalField   uniform 1000;

boundaryField
{
    modInlet
    {
       type             fixedFluxPressure;
        value           $internalField;
    }
    modOutlet
    {
        type            prghPressure;
        p               $internalField;
        value           $internalField;
    }
    modInner
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    modOuter
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
