tests/singlerod/short/openmc_openfoam/0.orig/fuel/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/bottomWater";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 565;

boundaryField
{
    fuelBottom
    {
        type            zeroGradient;;
        value           uniform 565;
    }
    fuelUpper
    {
        type            zeroGradient;
        value           uniform 565;
    }
    minY_fuel
    {
        type            zeroGradient;
        value           uniform 565;
//        type            fixedValue;
//        value           uniform 700;
    }
    fuelOuter
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 565;
        Tnbr            T;
        kappaMethod     solidThermo;
    }
}


// ************************************************************************* //
