tests/singlerod/short/openmc_openfoam/0.orig/moderator/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/bottomWater";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 565;

boundaryField
{
    modInlet
    {
        type            fixedValue;
        value           uniform 565;
    }
    modOutlet
    {
        type            zeroGradient;
//        type            inletOutlet;
        value           uniform 565;
//        inletValue      uniform 565;
    }
    modInner
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
//        type            fixedValue;
        value           uniform 600;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
    modOuter
    {
        type            zeroGradient;
        value           uniform 565;
    }
}


// ************************************************************************* //
