tests/singlerod/short/openmc_openfoam/0.orig/moderator/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.015;

boundaryField
{
    modInlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.02;       // 5% turbulent intensity
        value           $internalField;
    }
    modOutlet
    {
        type            inletOutlet;
        inletValue      $internalField;
    }
    modInner
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    modOuter
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
