tests/singlerod/short/openmc_openfoam/0.orig/moderator/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    modInlet
    {
        type            calculated;
        value           $internalField;
    }
    modOutlet
    {
        type            calculated;
        value           $internalField;
    }
    modInner
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    modOuter
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
