tests/singlerod/short/openmc_openfoam/system/moderator/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p_rgh.*"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0.01;
        maxIter          500;

//        smoother         DICGaussSeidel;

    }

    "(U|h|k|epsilon).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0.1;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p_rgh           1e-2;
        U               1e-4;
        h               1e-4;
        G               1e-4;
        "(k|epsilon)"   1e-4;       
    }
}

relaxationFactors
{
    rho             0.8;
    p_rgh           0.4;
    U               0.4;
    h               0.4;
    "(k|epsilon|omega)" 0.3;
}


// ************************************************************************* //
