tests/singlerod/short/openmc_openfoam/Allrun
#!/bin/sh

cd ${0%/*} || exit 1

. $WM_PROJECT_DIR/bin/tools/RunFunctions

runParallel $(getApplication)

